Revit 2024 API
LineLoad.Create Method
Overload List
Name | Description
Create(Document, ElementId, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
Create(Document, ElementId, Curve, XYZ, XYZ, LineLoadType)
 Creates a new custom line load within the project.
Create(Document, ElementId, Int32, XYZ, XYZ, LineLoadType)
 Creates a new hosted line load within the project.
See Also
LineLoad Class
LineLoad Members
Autodesk.Revit.DB.Structure Namespace